src/bsl/Documents/гкс_Взвешивание.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>гкс_Взвешивание</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесВведенВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесНеСтабилен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Весы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ОборудованиеПЛК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументРегистрации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гкс_РегистрацияНаПЛК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОтправки</Name>
					<Comment>WagonDispatchID</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_КлючиАналитикиСРПВ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КачествоНеПринято</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестнаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеВесов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВзвешивания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипыВзвешивания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/bsl/InformationRegisters/гкс_НастройкиОтключенияВходногоКонтроляКачества.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_НастройкиОтключенияВходногоКонтроляКачества</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВремяИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВидПеревозки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипыТранспортныхСредствДоставки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПунктПогрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЖДСтанция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_КлассификаторСтанцийЖД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/InformationRegisters/гкс_СРПВСтатусыОформленияВагонов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_СРПВСтатусыОформленияВагонов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гкс_Взвешивание</v8:Type>
						<v8:Type>cfg:DocumentRef.гкс_РегистрацияНаПЛК</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НомерВагона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.гкс_НомерВагона</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оформлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестнаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОперации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>КлючАналитикиСРПВ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_КлючиАналитикиСРПВ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.гкс_ДокументыСРПВ</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_СРПВСтатусыВагонов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/InformationRegisters/гкс_ВремяНахожденияТСНаПЛК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_ВремяНахожденияТСНаПЛК</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВремяВзвешенБрутто</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяВзвешенТара</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьОтклонение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отклонение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяНаПЛК</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДокументРегистрации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гкс_РегистрацияНаПЛК</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/InformationRegisters/гкс_ПриемкаТранспортаБезВходногоКонтроля.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_ПриемкаТранспортаБезВходногоКонтроля</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПроизводственныеСутки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументРегистрации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гкс_РегистрацияНаПЛК</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/InformationRegisters/гкс_СостоянияРегистрации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_СостоянияРегистрации</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_СостоянияРегистрации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестнаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипРегистрации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипРегистрации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРегистрации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гкс_РегистрацияНаПЛК</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПеревозки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипыТранспортныхСредствДоставки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/Enums/гкс_ТипыВзвешивания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>гкс_ТипыВзвешивания</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Въезд</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выезд</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/bsl/Enums/гкс_СРПВСтатусыВагонов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>гкс_СРПВСтатусыВагонов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Прибыл</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзвешенБрутто</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзвешенТара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выгружен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Погружен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/bsl/Enums/гкс_ТипРегистрации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>гкс_ТипРегистрации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приемка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгрузка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/bsl/Enums/гкс_СтатусыЛабораторногоАнализа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>гкс_СтатусыЛабораторногоАнализа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтборПробы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПовторныйАнализ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтмена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/bsl/Documents/гкс_Взвешивание/Ext/ObjectModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)

	ИдентификаторОтправки = Неопределено;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда

		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		гкс_ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);

		Если Не ЗначениеЗаполнено(МестнаяДата) И ЗначениеЗаполнено(ТочкаМаршрута) Тогда
			МестнаяДата = Справочники.гкс_ТочкиМаршрута.ПолучитьМестнуюДатуПоТочкеМаршрута(ТочкаМаршрута);
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	// проверка что нет других проведенных документов взвешивания данного типа
	// для регистрации на ПЛК
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Взвешивание.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.гкс_Взвешивание КАК Взвешивание
	|ГДЕ
	|	Взвешивание.Ссылка <> &Ссылка
	|	И Взвешивание.ТипВзвешивания = &ТипВзвешивания
	|	И Взвешивание.ДокументРегистрации = &ДокументРегистрации
	|	И НЕ Взвешивание.ПометкаУдаления";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ТипВзвешивания", ТипВзвешивания);
	Запрос.УстановитьПараметр("ДокументРегистрации", ДокументРегистрации);

	РезультатЗапроса = Запрос.Выполнить();

	Если Не РезультатЗапроса.Пустой() Тогда
		ТекстСообщения = НСтр("ru = 'У регистрации на ПЛК уже есть проведенный документ взвешивания.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);

	ЗапретИзменения = ЗапретИзмененияДокумента();

	Если ЗапретИзменения.Запрет Тогда

		ТекстСообщенияОЗапрете = СтрШаблон(ЗапретИзменения.ТекстСообщения, Ссылка);

		ОбщегоНазначения.СообщитьПользователю(ТекстСообщенияОЗапрете, , , , Отказ);

		// пишем в ЖР т.к. документы обрабатываются рег. заданием
		Если ПрименятьПроверкиЖД() Тогда
			ИмяСобытия = НСтр("ru = 'Запрет изменения документа'");
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(ИмяСобытия,
				УровеньЖурналаРегистрации.Предупреждение, Метаданные.Документы.гкс_Взвешивание, Ссылка,
				ТекстСообщенияОЗапрете);
		КонецЕсли;

		Возврат;
	КонецЕсли;

	гкс_ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);

	ЗаполнитьОрганизацию();

КонецПроцедуры

Процедура ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	гкс_ПроведениеДокументов.ПриЗаписиДокумента(ЭтотОбъект, Отказ);

	Документы.гкс_ОснованиеДляДвиженияЗапасов.АктуализироватьДокументДвиженияЗапасов(ДокументРегистрации, Отказ);

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	ДопПараметры = гкс_ПроведениеДокументов.ДопПараметрыИнициализироватьДанныеДокументаДляПроведения();
	ДопПараметры.ДополнительныеСвойства = Новый Структура;

	ПропускатьВходнойКонтроль = Ложь;

	ДелатьЗаписьВРегистрКачества = Ложь; // Флаг необходимости записи в регистр контроля качества

	Если ЗаписатьВРегистрПриемкаТранспортаБезВходногоКонтроля() Тогда

		ПропускатьВходнойКонтроль = РегистрыСведений.гкс_НастройкиОтключенияВходногоКонтроляКачества
			.ПроверитьПрименимостьПравилаОтключения(ДокументРегистрации, МестнаяДата);
    	Если ПропускатьВходнойКонтроль Тогда
			гкс_ПриемкаТранспорта.ЗаписатьРегистрПриемкиБезВходногоКонтроля(ДокументРегистрации);
    	КонецЕсли;
	КонецЕсли;

	СостояниеПриемкиВъезд = СостояниеКачестваПриемкиВъезд(ПропускатьВходнойКонтроль);
	ЗаполнитьДопПараметры(ДопПараметры, "СостояниеПриемкаВъезд", СостояниеПриемкиВъезд);

	гкс_ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ, ДопПараметры);

	Если ПропускатьВходнойКонтроль И СоздаватьНаправлениеНаРазгрузкуПриПропускеКонтроля(ДопПараметры) Тогда
		гкс_ПриемкаТранспорта.СоздатьНаправлениеНаРазгрузкуПриПропускеКонтроля(ДокументРегистрации);
	КонецЕсли;

	Если гкс_УчетВагоновСРПВ.ИспользуетсяИнтеграцияСРПВ()
		И ЗначениеЗаполнено(ИдентификаторОтправки) Тогда

		// приемка
		Если ТипВзвешивания = Перечисления.гкс_ТипыВзвешивания.Въезд Тогда
			Статус = Перечисления.гкс_СРПВСтатусыВагонов.ВзвешенБрутто;
			СформироватьНаправлениеНаРазгрузкуПриНеобходимости();
		Иначе
			Статус = Перечисления.гкс_СРПВСтатусыВагонов.ВзвешенТара;
		КонецЕсли;

		РегистрыСведений.гкс_СРПВСтатусыОформленияВагонов
			.ОтразитьСвязьСДокументомСРПВ(ИдентификаторОтправки, Статус, Ссылка);
	КонецЕсли;

	Если ФиксироватьВремяНахожденияТранспорта() Тогда
		РегистрыСведений.гкс_ВремяНахожденияТСНаПЛК.ДобавитьОбновитьЗапись(
			ДокументРегистрации, ТипВзвешивания, ТочкаМаршрута, МестнаяДата);
	КонецЕсли;


КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	гкс_ПроведениеДокументов.ОбработкаУдаленияПроведенияДокумента(ЭтотОбъект, Отказ);

	Если ЗаписатьВРегистрПриемкаТранспортаБезВходногоКонтроля() Тогда

		НаборЗаписей = РегистрыСведений.гкс_ПриемкаТранспортаБезВходногоКонтроля.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ДокументРегистрации.Установить(ДокументРегистрации);
		НаборЗаписей.Записать();

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЭтоВзвешиваниеВыезд()
	Возврат
		ТипВзвешивания = Перечисления.гкс_ТипыВзвешивания.Выезд;
КонецФункции

Функция НеПринятоПоПревышениюМаксимальногоВеса()
	// Если Не включена ФО, проверка не делается
	// Из формы передается Доп.свойство Состояние = НеПринятоПоПревышениюМаксимальногоВеса
	// при интерактивном заполнении документа
	Если Не ПолучитьФункциональнуюОпцию("гкс_ИспользоватьКонтрольПревышенияВесаАвтомобиля") Тогда
		Возврат Ложь;
	КонецЕсли;

	Возврат
		ДополнительныеСвойства.Свойство("Состояние")
		Или гкс_ПриемкаТранспорта.ПревышениеДопустимогоВесаАвтомобиля(ЭтотОбъект);

КонецФункции

Функция СостояниеКачестваПриемкиВъезд(ПропускатьВходнойКонтроль)

	СостояниеПриемкаВъезд = Перечисления.гкс_СостоянияРегистрации.ГотовКОтборуПроб;
	Если НеПринятоПоПревышениюМаксимальногоВеса() Тогда
		СостояниеПриемкаВъезд =
			Перечисления.гкс_СостоянияРегистрации.НеПринятоПоПревышениюМаксимальногоВеса;
	ИначеЕсли ПропускатьВходнойКонтроль Тогда
		СостояниеПриемкаВъезд = Перечисления.гкс_СостоянияРегистрации.КачествоПринято;
	КонецЕсли;

	Возврат СостояниеПриемкаВъезд;

КонецФункции

Процедура ЗаполнитьДопПараметры(ДопПараметры, ИмяДопРеквизита, ЗначениеДопРеквизита)

	ДопПараметры.ДополнительныеСвойства.Вставить(ИмяДопРеквизита, ЗначениеДопРеквизита);

КонецПроцедуры

Процедура ЗаполнитьОрганизацию()

	Если Не ЗначениеЗаполнено(Организация) Тогда
		Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументРегистрации, "Организация");
	КонецЕсли;

КонецПроцедуры

//  Структура - Запрет изменения документа
//		- Запрет 			- Булево - признак запрета
//		- ТекстСообщения 	- Строка - расшифровка причины запрета
Функция ЗапретИзмененияДокумента()

	Результат = Новый Структура("Запрет, ТекстСообщения", Ложь, "");

	ТипРегистрации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументРегистрации, "ТипРегистрации");

	Если ТипРегистрации = Перечисления.гкс_ТипРегистрации.Приемка Тогда
		Результат.Запрет =  ЗапретИзмененияДокументаПоПриемке();
		Результат.ТекстСообщения = НСтр("ru = 'Не удалось записать документ: %1 т.к. уже оформлен реестр ЗПП-3'");
	Иначе
		Результат.Запрет = ЗапретИзмененияДокументаПоОтгрузке();
		Результат.ТекстСообщения = НСтр("ru = 'Не удалось записать документ: %1 т.к. транспорт уже убыл'");
	КонецЕсли;

	Возврат Результат;

КонецФункции

Функция ПрименятьПроверкиЖД()

	ВидПеревозки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументРегистрации, "ВидПеревозки");

	Возврат ВидПеревозки = Перечисления.гкс_ТипыТранспортныхСредствДоставки.ЖДТранспорт
		И гкс_УчетВагоновСРПВ.ИспользуетсяИнтеграцияСРПВ();

КонецФункции

Функция ЗапретИзмененияДокументаПоПриемке()

	Если гкс_ПриемкаТранспорта.ЗапретИзмененияДокументаПоРеестру(Ссылка) Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции

Функция ЗапретИзмененияДокументаПоОтгрузке()

	Если ДополнительныеСвойства.Свойство("НеПроверятьЗапретРедактированияОтгрузки") Тогда
		Возврат Ложь;
	КонецЕсли;

	ЗапретИзменения = Ложь;

	ВидПеревозки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументРегистрации, "ВидПеревозки");

	// Для автомобильного транспорта оставляем проверку статуса убыл
	Если ВидПеревозки = Перечисления.гкс_ТипыТранспортныхСредствДоставки.Автомобиль Тогда
		ЗапретИзменения = РегистрыСведений.гкс_СостоянияРегистрации.УжеУбыл(ДокументРегистрации);
	КонецЕсли;

	Возврат ЗапретИзменения;

КонецФункции

Процедура СформироватьНаправлениеНаРазгрузкуПриНеобходимости()

	РазрешитьВходнойКонтрольДоВзвешивания =
		гкс_ПриемкаТранспорта.РазрешитьВходнойКонтрольДоВзвешиванияПоРегистрации(ДокументРегистрации);
	Если Не РазрешитьВходнойКонтрольДоВзвешивания Тогда
		Возврат;
	КонецЕсли;

	Состояние = РегистрыСведений.гкс_СостоянияРегистрации.ТекущееСостояниеПоРегистрации(ДокументРегистрации);
	Если ЭтоВзвешиваниеВъезд() И Состояние = Перечисления.гкс_СостоянияРегистрации.КачествоПринято Тогда

		ЛабораторныйАнализ = гкс_ПриемкаТранспорта.ОпределитьЛабораторныйАнализ(ДокументРегистрации,
			Перечисления.гкс_НазначенияИспользованияКачества.Приемка,
			Перечисления.гкс_СтатусыЛабораторногоАнализа.Выполнен);
		Если ЗначениеЗаполнено(ЛабораторныйАнализ) Тогда
			гкс_ПриемкаТранспорта.СформироватьНаправлениеНаРазгрузку(Дата, ДокументРегистрации, ЛабораторныйАнализ);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Функция ЭтоВзвешиваниеВъезд()
	Возврат
		ТипВзвешивания = Перечисления.гкс_ТипыВзвешивания.Въезд
		И Вес <> 0;
КонецФункции

Функция ЗаписатьВРегистрПриемкаТранспортаБезВходногоКонтроля()

	Возврат
		ПолучитьФункциональнуюОпцию("гкс_ИспользоватьОтключениеВходногоКонтроляКачества")
		И ЭтоВзвешиваниеВъезд()
		И гкс_ПриемкаТранспорта.ТипРегистрацииПриемка(ДокументРегистрации);
КонецФункции

// Проверяет необходимость создания направления на разгрузку при пропуске контроля.
// Возвращает Истина если:
// - Для ЖД транспорта: проверка есть превышение отклонения брутто
// - Для автомобиля: всегда
//
// Параметры:
//  ДопПараметры Доп параметры
//
// Возвращаемое значение:
//  Булево - Создавать направление на разгрузку при пропуске контроля
Функция СоздаватьНаправлениеНаРазгрузкуПриПропускеКонтроля(ДопПараметры)
	Если Не ЭтоВзвешиваниеВъезд() Тогда
		Возврат Ложь;
	КонецЕсли;

	Состояние = Неопределено;
	Если ДопПараметры <> Неопределено
      И ТипЗнч(ДопПараметры.ДополнительныеСвойства) = Тип("Структура") Тогда
      	ДопПараметры.ДополнительныеСвойства.Свойство("СостояниеПриемкаВъезд", Состояние);
  	КонецЕсли;

	Возврат Состояние = Перечисления.гкс_СостоянияРегистрации.КачествоПринято;
КонецФункции

Функция ФиксироватьВремяНахожденияТранспорта()
	ДанныеРегистрации = гкс_ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументРегистрации, "ВидПеревозки, ТипРегистрации");
	Возврат
		РегистрыСведений.гкс_ВремяНахожденияТСНаПЛК.УчитыватьВремяНахожденияТС(
			ДанныеРегистрации.ТипРегистрации, ДанныеРегистрации.ВидПеревозки, ТочкаМаршрута)
		И Вес <> 0;
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
#КонецЕсли
